Revit 2027 API
BuiltInFailures.ElectricalFailures.NumberOfCircuitFullOnSwitchPanel Property
 You can't connect to switchboard [Panel Name] because there aren't enough space. \nYou can increase the number of circuits to be greater than [Number] to connect through breakers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NumberOfCircuitFullOnSwitchPanel { get; }
Public Shared ReadOnly Property NumberOfCircuitFullOnSwitchPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NumberOfCircuitFullOnSwitchPanel {
	FailureDefinitionId^ get ();
}
static member NumberOfCircuitFullOnSwitchPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace